Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
//was only gWidth for line by line draw - return it if will be low RAM
			uint8_t pbuffer[gWidth[gNum]*gHeight[gNum]];
Serial.printf("[Font::drawGlyph] font widh %u, height %u\n\n", gWidth[gNum], gHeight[gNum]);
			T_DispCoords xs = 0;
			uint32_t dl = 0;

/*****************
* ToDo: move it to printing texts
*
			T_DispCoords cy = cursor_y + gFont.maxAscent - gdY[gNum];
			T_DispCoords cx = cursor_x + gdX[gNum];
			ImageBuffer->init(2,sizeof(uint16_t),cx,cy);
****************/
//			startWrite(); // Avoid slow ESP32 transaction overhead for every pixel

			// Read font data to alpha-array
			fontFile->read(pbuffer, gWidth[gNum]*gHeight[gNum]);
			// Createbuffer with foreground color
			// ToDo: Create function in Display for drawing one color by alpha-mask
			uint16_t *data;
			t_color_r5g6b5 *pix_dst=new (t_color_r5g6b5);
			Device::Display::Graphics::Graph->color_R8G8B8toR5G6B5(pix_dst, (t_color_r8g8b8 *)&this->textcolor);
Serial.printf("[Font::drawGlyph] textcolor %u, color565 %u\n\n", (uint32_t) this->textcolor, *((uint32_t*) pix_dst));
			data=(uint16_t *) malloc(gWidth[gNum]*gHeight[gNum]*sizeof(t_color_r5g6b5));
			for (int y = 0; y < gHeight[gNum]; y++){
				for (int x = 0; x < gWidth[gNum]; x++){
					memcpy(data+x*y,pix_dst,sizeof(t_color_r5g6b5));
				}
			}
			// Pushing data to draw
			Device::Display::Graphics::Graph->drawImageBufferAlpha(cx, cy, data, pbuffer, gWidth[gNum], gHeight[gNum]);


/*
// ToDo: next is old code from original, need to comment it or remove
			for (int y = 0; y < gHeight[gNum]; y++)
			{
			  if (spiffs)
			  {
				fontFile->read(pbuffer, gWidth[gNum]);
				//Serial.println("SPIFFS");
			  }
			  else
			  {
//				endWrite();    // Release SPI for SD card transaction
				fontFile->read(pbuffer, gWidth[gNum]);
//				startWrite();  // Re-start SPI for TFT transaction
				//Serial.println("Not SPIFFS");
			  }

			  for (int x = 0; x < gWidth[gNum]; x++)
			  {
				uint8_t pixel = pbuffer[x]; //<//
				if (pixel)
				{
*//*
					if (pixel != 0xFF)
				  {
					if (dl) {
					  if (dl==1) drawPixel(xs, y + cy, fg);
					  else drawFastHLine( xs, y + cy, dl, fg);
					  dl = 0;
					}
					drawPixel(x + cx, y + cy,
						#ifdef FONT_ALPHABLEND
							alphaBlend(pixel, fg, bg)
						#else
							fg
						#endif
						);
				  }
				  else
				  {
					if (dl==0) xs = x + cx;
					dl++;
				  }// * /

				}
				else
				{
//				  if (dl) { drawFastHLine( xs, y + cy, dl, fg); dl = 0; }
				}
			  }
//			  if (dl) { drawFastHLine( xs, y + cy, dl, fg); dl = 0; }
			}// */

// Move to text printing			cursor_x += gxAdvance[gNum];
//			endWrite();
		  }
		  else
		  {
//testing font 1
			  //cheight = (glyph_ab + glyph_bb) * textsize;
			  // Get the offset for the first character only to allow for negative offsets
			  uint16_t c2 = 0;
			  //uint16_t len = strlen(string);
			  uint16_t n = 0;

			  //while (n < len && c2 == 0) c2 = decodeUTF8((uint8_t*)string, &n, len - n);

			  if((c2 >= pgm_read_word(&gfxFont->first)) && (c2 <= pgm_read_word(&gfxFont->last) ))
			  {
				c2 -= pgm_read_word(&gfxFont->first);
				GFXglyph *glyph = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c2]);
				//xo = pgm_read_byte(&glyph->xOffset) * textsize;
				// Adjust for negative xOffset
				//if (xo > 0) xo = 0;
				//else cwidth -= xo;
				// Add 1 pixel of padding all round
				//cheight +=2;
				//fillRect(poX+xo-1, poY - 1 - glyph_ab * textsize, cwidth+2, cheight, textbgcolor);
				//Device::Display::Graphics::Graph->fillRect(poX+xo, poY - glyph_ab * textsize, cwidth, cheight, textbgcolor); //ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			  }
				uint16_t *data;
				t_color_r5g6b5 *pix_dst=new (t_color_r5g6b5);
				Device::Display::Graphics::Graph->color_R8G8B8toR5G6B5(pix_dst, (t_color_r8g8b8 *)&this->textcolor);
	Serial.printf("[Font::drawGlyph] textcolor %u, color565 %u\n\n", (uint32_t) this->textcolor, *((uint32_t*) pix_dst));
				data=(uint16_t *) malloc(gWidth[gNum]*gHeight[gNum]*sizeof(t_color_r5g6b5));
				for (int y = 0; y < gHeight[gNum]; y++){
					for (int x = 0; x < gWidth[gNum]; x++){
						memcpy(data+x*y,pix_dst,sizeof(t_color_r5g6b5));
					}
				}
				// Pushing data to draw
				//Device::Display::Graphics::Graph->drawImageBufferAlpha(cx, cy, data, pbuffer, gWidth[gNum], gHeight[gNum]);
//end of testing font 1
			// Not a Unicode in font so draw a rectangle and move on cursor
//			drawRect(cursor_x, cursor_y + gFont.maxAscent - gFont.ascent, gFont.spaceWidth, gFont.ascent, fg);
// move to printing text			cursor_x += gFont.spaceWidth + 1;
		  }
// move to printing text		  ImageBuffer->Set(cursor_x, cursor_y);
		}

		/***************************************************************************************
		** Function name:           showFont
		** Description:             Page through all characters in font, td ms between screens
		*************************************************************************************x*/
		void Font::showFont(uint32_t td, Screen &display)
		{
/*		  if(!fontLoaded) return;

		  if(!fontFile)
		  {
			fontLoaded = false;
			return;
		  }

		  int16_t cursorX = Device::Display::Driver->width(); // Force start of new page to initialise cursor
		  int16_t cursorY = Device::Display::Driver->height();// for the first character
		  uint32_t timeDelay = 0;    // No delay before first page
		  c_Cursor *cursor=Cursor();

		  fillScreen(_textbgcolor());
		  //fillScreen(textbgcolor);

		  for (uint16_t i = 0; i < gFont.gCount; i++)
		  {
			// Check if this will need a new screen
			if (cursorX + gdX[i] + gWidth[i] >= Device::Display::Driver->width())  {
			  cursorX = -gdX[i];

			  cursorY += gFont.yAdvance;
			  if (cursorY + gFont.maxAscent + gFont.descent >= Device::Display::Driver->height()) {
				cursorX = -gdX[i];
				cursorY = 0;
				delay(timeDelay);
				timeDelay = td;
				fillScreen(_textbgcolor());
			  }
			}

			ImageBuffer->Set(cursorX, cursorY);
			drawGlyph(gUnicode[i], *cursor);
			cursorX += gxAdvance[i];
			//cursorX +=  printToSprite( cursorX, cursorY, i );
			yield();
		  }

		  delay(timeDelay);
		  fillScreen(_textbgcolor());
		  //fillScreen(textbgcolor);
		  //fontFile.close();

*/		}


		/**************************************************************************
		** Function name:           setAttribute
		** Description:             Sets a control parameter of an attribute
		**************************************************************************/
		void Font::setAttribute(uint8_t attr_id, uint8_t param) {
			switch (attr_id) {
					break;
				case 1:
					_cp437 = param;
					break;
				case 2:
					_utf8  = param;
					break;
				//case 3: // TBD future feature control
				//    _tbd = param;
				//    break;
			}
		}


		/**************************************************************************
		** Function name:           getAttribute
		** Description:             Get value of an attribute (control parameter)
		**************************************************************************/
		uint8_t Font::getAttribute(uint8_t attr_id) {
			switch (attr_id) {
				case 1: // ON/OFF control of full CP437 character set
					return _cp437;
					break;
				case 2: // ON/OFF control of UTF-8 decoding
					return _utf8;
					break;
				//case 3: // TBD future feature control
				//    return _tbd;
				//    break;
			}

