Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			return false;
		}

		/***************************************************************************************
		** Function name:           setTextSize
		** Description:             Set the text size multiplier
		***************************************************************************************/
		void Font::setTextSize(uint8_t s)
		{
		  if (s>7) s = 7; // Limit the maximum size multiplier so byte variables can be used for rendering
		  textsize = (s > 0) ? s : 1; // Don't allow font size 0
		}


		/***************************************************************************************
		** Function name:           setTextColor
		** Description:             Set the font foreground colour (background is transparent)
		***************************************************************************************/
		void Font::setTextColor(uint16_t c)
		{
		  // For 'transparent' background, we'll set the bg
		  // to the same as fg instead of using a flag
		  textcolor = textbgcolor = c;
		}


		/***************************************************************************************
		** Function name:           setTextColor
		** Description:             Set the font foreground and background colour
		***************************************************************************************/
		void Font::setTextColor(uint16_t c, uint16_t b)
		{
		  textcolor   = c;
		  textbgcolor = b;
		}

		/***************************************************************************************
		** Function name:           setTextWrap
		** Description:             Define if text should wrap at end of line
		***************************************************************************************/
		void Font::setTextWrap(boolean wrapX, boolean wrapY)
		{
		  textwrapX = wrapX;
		  textwrapY = wrapY;
		}


		/***************************************************************************************
		** Function name:           setTextDatum
		** Description:             Set the text position reference datum
		***************************************************************************************/
		void Font::setTextDatum(uint8_t d)
		{
		  textdatum = d;
		}


		/***************************************************************************************
		** Function name:           setTextPadding
		** Description:             Define padding width (aids erasing old text and numbers)
		***************************************************************************************/
		void Font::setTextPadding(T_DispCoords x_width)
		{
		  padX = x_width;
		}

		/***************************************************************************************
		** Function name:           textWidth
		** Description:             Return the width in pixels of a string in a given font
		***************************************************************************************/
		T_DispCoords Font::textWidth(const String& string)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return textWidth(buffer, textfont);
		}

		T_DispCoords Font::textWidth(const String& string, uint8_t font)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return textWidth(buffer, font);
		}

		T_DispCoords Font::textWidth(const char *string)
		{
		  return textWidth(string, textfont);
		}

		T_DispCoords Font::textWidth(const char *string, uint8_t font)
		{
		  T_DispCoords str_width = 0;
		  uint16_t uniCode  = 0;

		#ifdef SMOOTH_FONT
		  if(fontLoaded)
		  {
			while (*string)
			{
			  uniCode = decodeUTF8(*string++);
			  if (uniCode)
			  {
				if (uniCode == 0x20) str_width += gFont.spaceWidth;
				else
				{
				  uint16_t gNum = 0;
				  bool found = getUnicodeIndex(uniCode, &gNum);
				  if (found)
				  {
					if(str_width == 0 && gdX[gNum] < 0) str_width -= gdX[gNum];
					if (*string || isDigits) str_width += gxAdvance[gNum];
					else str_width += (gdX[gNum] + gWidth[gNum]);
				  }
				  else str_width += gFont.spaceWidth + 1;
				}
			  }
			}
			isDigits = false;
			return str_width;
		  }
		#endif

		  if (font>1 && font<9)
		  {
			char *widthtable = (char *)pgm_read_dword( &(fontdata[font].widthtbl ) ) - 32; //subtract the 32 outside the loop

			while (*string)
			{
			  uniCode = *(string++);
			  if (uniCode > 31 && uniCode < 128)
			  str_width += pgm_read_byte( widthtable + uniCode); // Normally we need to subtract 32 from uniCode
			  else str_width += pgm_read_byte( widthtable + 32); // Set illegal character = space width
			}

		  }
		  else
		  {

		#ifdef LOAD_GFXFF
			if(gfxFont) // New font
			{
			  while (*string)
			  {
				uniCode = decodeUTF8(*string++);
				if ((uniCode >= pgm_read_word(&gfxFont->first)) && (uniCode <= pgm_read_word(&gfxFont->last )))
				{
				  uniCode -= pgm_read_word(&gfxFont->first);
				  GFXglyph *glyph  = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[uniCode]);
				  // If this is not the  last character or is a digit then use xAdvance
				  if (*string  || isDigits) str_width += pgm_read_byte(&glyph->xAdvance);
				  // Else use the offset plus width since this can be bigger than xAdvance
				  else str_width += ((int8_t)pgm_read_byte(&glyph->xOffset) + pgm_read_byte(&glyph->width));
				}
			  }
			}
			else
		#endif
			{
		#ifdef LOAD_GLCD
			  while (*string++) str_width += 6;
		#endif
			}
		  }
		  isDigits = false;
		  return str_width * textsize;
		}

		/***************************************************************************************
		** Function name:           textWidthFit
		** Description:             Return amount of symbols fits in the width
		***************************************************************************************/
		uint8_t Font::textWidthFit(const char *string, uint8_t font, T_DispCoords twidth){
			  T_DispCoords str_width = 0;
			  uint16_t uniCode  = 0;
			  uint8_t scount = 0; // counting symbols

			#ifdef SMOOTH_FONT
			  if(fontLoaded)
			  {
				while (*string)
				{
				  uniCode = decodeUTF8(*string++);
				  if (uniCode)
				  {
					if (uniCode == 0x20) str_width += gFont.spaceWidth * textsize;
					else
					{
					  uint16_t gNum = 0;
					  bool found = getUnicodeIndex(uniCode, &gNum);
					  if (found)
					  {
						if(str_width == 0 && gdX[gNum] < 0) str_width -= gdX[gNum] * textsize;
						if (*string || isDigits) str_width += gxAdvance[gNum] * textsize;
						else str_width += (gdX[gNum] + gWidth[gNum]) * textsize;
					  }
					  else str_width += (gFont.spaceWidth + 1) * textsize;
					}
				  }
				  if ( str_width < twidth) scount++; else break;
				}
				isDigits = false;
				return scount;
			  }
			#endif

			  if (font>1 && font<9)
			  {
				char *widthtable = (char *)pgm_read_dword( &(fontdata[font].widthtbl ) ) - 32; //subtract the 32 outside the loop

				while (*string)
				{
				  uniCode = *(string++);
				  if (uniCode > 31 && uniCode < 128)
				  str_width += pgm_read_byte( widthtable + uniCode) * textsize; // Normally we need to subtract 32 from uniCode
				  else str_width += pgm_read_byte( widthtable + 32) * textsize; // Set illegal character = space width
				  if ( str_width < twidth) scount++; else break;
				}

