Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
		  int8_t xo = 0;
		#ifdef LOAD_GFXFF
		  if (freeFont && (textcolor!=textbgcolor))
			{
			  cheight = (glyph_ab + glyph_bb) * textsize;
			  // Get the offset for the first character only to allow for negative offsets
			  uint16_t c2 = 0;
			  uint16_t len = strlen(string);
			  uint16_t n = 0;

			  while (n < len && c2 == 0) c2 = decodeUTF8((uint8_t*)string, &n, len - n);

			  if((c2 >= pgm_read_word(&gfxFont->first)) && (c2 <= pgm_read_word(&gfxFont->last) ))
			  {
				c2 -= pgm_read_word(&gfxFont->first);
				GFXglyph *glyph = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c2]);
				xo = pgm_read_byte(&glyph->xOffset) * textsize;
				// Adjust for negative xOffset
				if (xo > 0) xo = 0;
				else cwidth -= xo;
				// Add 1 pixel of padding all round
				//cheight +=2;
				//fillRect(poX+xo-1, poY - 1 - glyph_ab * textsize, cwidth+2, cheight, textbgcolor);
				Device::Display::Graphics::Graph->fillRect(poX+xo, poY - glyph_ab * textsize, cwidth, cheight, textbgcolor); //ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			  }
			  padding -=100;
			}
		#endif

		  uint16_t len = strlen(string);
		  uint16_t n = 0;

		#ifdef SMOOTH_FONT
		  if(fontLoaded)
		  {
			if (textcolor!=textbgcolor) Device::Display::Graphics::Graph->fillRect(poX, poY, cwidth, cheight, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			//drawLine(poX - 5, poY, poX + 5, poY, TFT_GREEN);
			//drawLine(poX, poY - 5, poX, poY + 5, TFT_GREEN);
			//fontFile = SPIFFS.open( _gFontFilename, "r");
			if(!fontFile) return 0;

//			ImageBuffer->Set(poX, poY);

			while (n < len)
			{
			  uint16_t uniCode = decodeUTF8((uint8_t*)string, &n, len - n);
			  drawGlyph(uniCode, poX, poY);//, *cursor); //ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			}
			sumX += cwidth;
			//fontFile.close();
		  }
		  else
		#endif
		  {
			while (n < len)
			{
			  uint16_t uniCode = decodeUTF8((uint8_t*)string, &n, len - n);
			  sumX += drawChar(uniCode, poX+sumX, poY, font);
			}
		  }

		//vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv DEBUG vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
		// Switch on debugging for the padding areas
		//#define PADDING_DEBUG

		#ifndef PADDING_DEBUG
		//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ DEBUG ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

		  if((padX>cwidth) && (textcolor!=textbgcolor))
		  {
			int16_t padXc = poX+cwidth+xo;
		#ifdef LOAD_GFXFF
			if (freeFont)
			{
			  poX +=xo; // Adjust for negative offset start character
			  poY -= glyph_ab * textsize;
			  sumX += poX;
			}
		#endif
			switch(padding) {
			  case 1:
				Device::Display::Graphics::Graph->fillRect(padXc,poY,padX-cwidth,cheight, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				break;
			  case 2:
				Device::Display::Graphics::Graph->fillRect(padXc,poY,(padX-cwidth)>>1,cheight, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				padXc = (padX-cwidth)>>1;
				if (padXc>poX) padXc = poX;
				Device::Display::Graphics::Graph->fillRect(poX - padXc,poY,(padX-cwidth)>>1,cheight, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				break;
			  case 3:
				if (padXc>padX) padXc = padX;
				Device::Display::Graphics::Graph->fillRect(poX + cwidth - padXc,poY,padXc-cwidth,cheight, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				break;
			}
		  }


		#else

		//vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv DEBUG vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
		// This is debug code to show text (green box) and blanked (white box) areas
		// It shows that the padding areas are being correctly sized and positioned

		  if((padX>sumX) && (textcolor!=textbgcolor))
		  {
			int16_t padXc = poX+sumX; // Maximum left side padding
		#ifdef LOAD_GFXFF
			if ((font == 1) && (gfxFont)) poY -= glyph_ab;
		#endif
			drawRect(poX,poY,sumX,cheight, TFT_GREEN);
			switch(padding) {
			  case 1:
				  Device::Display::Graphics::Graph->drawRect(padXc,poY,padX-sumX,cheight, TFT_WHITE);
				break;
			  case 2:
				  Device::Display::Graphics::Graph->drawRect(padXc,poY,(padX-sumX)>>1, cheight, TFT_WHITE);
				padXc = (padX-sumX)>>1;
				if (padXc>poX) padXc = poX;
				Device::Display::Graphics::Graph->drawRect(poX - padXc,poY,(padX-sumX)>>1,cheight, TFT_WHITE);
				break;
			  case 3:
				if (padXc>padX) padXc = padX;
				Device::Display::Graphics::Graph->drawRect(poX + sumX - padXc,poY,padXc-sumX,cheight, TFT_WHITE);
				break;
			}
		  }
		#endif
		//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ DEBUG ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

		return sumX;
		}


		/***************************************************************************************
		** Function name:           drawCentreString (deprecated, use setTextDatum())
		** Descriptions:            draw string centred on dX
		***************************************************************************************/
		T_DispCoords Font::drawCentreString(const String& string, T_DispCoords dX, T_DispCoords poY, uint8_t font)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return drawCentreString(buffer, dX, poY, font);
		}

		T_DispCoords Font::drawCentreString(const char *string, T_DispCoords dX, T_DispCoords poY, uint8_t font)
		{
		  uint8_t tempdatum = textdatum;
		  int32_t sumX = 0;
		  textdatum = TC_DATUM;
		  sumX = drawString(string, dX, poY, font);
		  textdatum = tempdatum;
		  return sumX;
		}


		/***************************************************************************************
		** Function name:           drawRightString (deprecated, use setTextDatum())
		** Descriptions:            draw string right justified to dX
		***************************************************************************************/
		T_DispCoords Font::drawRightString(const String& string, T_DispCoords dX, T_DispCoords poY, uint8_t font)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return drawRightString(buffer, dX, poY, font);
		}

		T_DispCoords Font::drawRightString(const char *string, T_DispCoords dX, T_DispCoords poY, uint8_t font)
		{
		  uint8_t tempdatum = textdatum;
		  int16_t sumX = 0;
		  textdatum = TR_DATUM;
		  sumX = drawString(string, dX, poY, font);
		  textdatum = tempdatum;
		  return sumX;
		}


		/***************************************************************************************
		** Function name:           drawNumber
		** Description:             draw a long integer
		***************************************************************************************/
		T_DispCoords Font::drawNumber(long long_num, T_DispCoords poX, T_DispCoords poY)
		{
		  isDigits = true; // Eliminate jiggle in monospaced fonts
		  char str[12];
		  ltoa(long_num, str, 10);
		  return drawString(str, poX, poY, textfont);
		}

		T_DispCoords Font::drawNumber(long long_num, T_DispCoords poX, T_DispCoords poY, uint8_t font)
		{
		  isDigits = true; // Eliminate jiggle in monospaced fonts
		  char str[12];
		  ltoa(long_num, str, 10);
		  return drawString(str, poX, poY, font);
		}


		/***************************************************************************************
		** Function name:           drawFloat
		** Descriptions:            drawFloat, prints 7 non zero digits maximum
		***************************************************************************************/
		// Assemble and print a string, this permits alignment relative to a datum
		// looks complicated but much more compact and actually faster than using print class
		T_DispCoords Font::drawFloat(float floatNumber, uint8_t dp, T_DispCoords poX, T_DispCoords poY)
		{
		  return drawFloat(floatNumber, dp, poX, poY, textfont);
		}

