Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
				for (int32_t i = 0; i < height; i++)
				  {


					for (int32_t k = 0; k < w; k++)
					{
					  line = pgm_read_byte((uint8_t *)flash_address + w * i + k);

					  if (line) {
						if (textsize == 1) {
						  pX = x + k * 8;
						  if (line & 0x80) Device::Display::Graphics::Graph->drawPixel(pX, pY, textcolor);
						  if (line & 0x40) Device::Display::Graphics::Graph->drawPixel(pX + 1, pY, textcolor);
						  if (line & 0x20) Device::Display::Graphics::Graph->drawPixel(pX + 2, pY, textcolor);
						  if (line & 0x10) Device::Display::Graphics::Graph->drawPixel(pX + 3, pY, textcolor);
						  if (line & 0x08) Device::Display::Graphics::Graph->drawPixel(pX + 4, pY, textcolor);
						  if (line & 0x04) Device::Display::Graphics::Graph->drawPixel(pX + 5, pY, textcolor);
						  if (line & 0x02) Device::Display::Graphics::Graph->drawPixel(pX + 6, pY, textcolor);
						  if (line & 0x01) Device::Display::Graphics::Graph->drawPixel(pX + 7, pY, textcolor);
						}
						else {
						  pX = x + k * 8 * textsize;
						  if (line & 0x80) Device::Display::Graphics::Graph->fillRect(pX, pY, textsize, textsize, textcolor);
						  if (line & 0x40) Device::Display::Graphics::Graph->fillRect(pX + textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x20) Device::Display::Graphics::Graph->fillRect(pX + 2 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x10) Device::Display::Graphics::Graph->fillRect(pX + 3 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x08) Device::Display::Graphics::Graph->fillRect(pX + 4 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x04) Device::Display::Graphics::Graph->fillRect(pX + 5 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x02) Device::Display::Graphics::Graph->fillRect(pX + 6 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x01) Device::Display::Graphics::Graph->fillRect(pX + 7 * textsize, pY, textsize, textsize, textcolor);
						}
					  }
					}
					pY += textsize;
				  }

//				}
/*				else
				  // Faster drawing of characters and background using block write
				{
				  uint8_t mask;
				  for (int32_t i = 0; i < height; i++)
				  {
					pX = width;
					for (int32_t k = 0; k < w; k++)
					{
					  line = pgm_read_byte((uint8_t *) (flash_address + w * i + k) );
					  mask = 0x80;
					  while (mask && pX) {
						if (line & mask) {tft_Write_16(textcolor);}
						else {if (bgfill) tft_Write_16(textbgcolor);}
						pX--;
						mask = mask >> 1;
					  }
					}
					if (pX) {tft_Write_16(textbgcolor);}
				  }
				} // */
			  }

			  #ifdef LOAD_RLE
			  else
			  #endif
			#endif  //FONT2

			#ifdef LOAD_RLE  //674 bytes of code
			  // Font is not 2 and hence is RLE encoded
			  {
				w *= height; // Now w is total number of pixels in the character
				if ((textsize != 1) || (textcolor == textbgcolor)) {
				  if (bgfill) if (textcolor != textbgcolor) Device::Display::Graphics::Graph->fillRect(x, pY, width * textsize, textsize * height, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				  int32_t px = 0, py = pY; // To hold character block start and end column and row values
				  int32_t pc = 0; // Pixel count
				  uint8_t np = textsize * textsize; // Number of pixels in a drawn pixel

				  uint8_t tnp = 0; // Temporary copy of np for while loop
				  uint8_t ts = textsize - 1; // Temporary copy of textsize
				  // 16 bit pixel count so maximum font size is equivalent to 180x180 pixels in area
				  // w is total number of pixels to plot to fill character block
				  while (pc < w)
				  {
					line = pgm_read_byte((uint8_t *)flash_address);
					flash_address++;
					if (line & 0x80) {
					  line &= 0x7F;
					  line++;
					  if (ts) {
						px = x + textsize * (pc % width); // Keep these px and py calculations outside the loop as they are slow
						py = y + textsize * (pc / width);
					  }
					  else {
						px = x + pc % width; // Keep these px and py calculations outside the loop as they are slow
						py = y + pc / width;
					  }
					  while (line--) { // In this case the while(line--) is faster
						pc++; // This is faster than putting pc+=line before while()?
						Device::Display::Driver->setWindow(px, py, px + ts, py + ts);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

//						Device::Display::Driver->pushColors(uint8_t *data, np);

						if (ts) {
						  tnp = np;
						  while (tnp--) {
							  tft_Write_16(textcolor);
							  //pushColor(uint16_t color)
						  } //pushColors
						}else {tft_Write_16(textcolor);}
						px += textsize;

						if (px >= (x + width * textsize))
						{
						  px = x;
						  py += textsize;
						}
					  }
					}
					else {
					  line++;
					  pc += line;
					}
				  }
				}
				else // Text colour != background && textsize = 1
					 // so use faster drawing of characters and background using block write
				{
//				  setWindow(x, y, x + width - 1, y + height - 1);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

			#ifdef RPI_WRITE_STROBE
				  uint8_t textcolorBin[] = { (uint8_t) (textcolor >> 8), (uint8_t) textcolor };
				  uint8_t textbgcolorBin[] = { (uint8_t) (textbgcolor >> 8), (uint8_t) textbgcolor };
			#endif

				  // Maximum font size is equivalent to 180x180 pixels in area
				  while (w > 0)
				  {
					line = pgm_read_byte((uint8_t *)flash_address++); // 8 bytes smaller when incrementing here
					if (line & 0x80) {
					  line &= 0x7F;
					  line++; w -= line;
			#ifdef RPI_WRITE_STROBE
					  spi.writePattern(&textcolorBin[0], 2, 1); line--;
					  while(line--) {WR_L; WR_H;}
			#else
					  #ifdef ESP32_PARALLEL
						while (line--) {tft_Write_16(textcolor);}
					  #else
//						writeBlock(textcolor,line);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
					  #endif
			#endif
					}
					else {
					  line++; w -= line;
			#ifdef RPI_WRITE_STROBE
					  spi.writePattern(&textbgcolorBin[0], 2, 1); line--;
					  while(line--) {WR_L; WR_H;}
			#else
					  #ifdef ESP32_PARALLEL
						while (line--) {tft_Write_16(textbgcolor);}
					  #else
//						writeBlock(textbgcolor,line);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
					  #endif
			#endif
					}
				  }
				}
/*				inTransaction = false;
				spi_end();*///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			  }
			  // End of RLE font rendering
			#endif
			  return width * textsize;    // x +
			}
			/***************************************************************************************
			** Function name:           getTextDatum
			** Description:             Return the text datum value (as used by setTextDatum())
			***************************************************************************************/
			uint8_t Font::getTextDatum(void)
			{
			  return textdatum;
			}

			/***************************************************************************************
			** Function name:           drawChar
			** Description:             draw a single character in the Adafruit GLCD font
			***************************************************************************************/
			void Font::drawChar(T_DispCoords x, T_DispCoords y, uint16_t c, uint32_t color, uint32_t bg, uint8_t size)
			{
			  if ((x >= Device::Display::Graphics::Graph->width())            || // Clip right
				  (y >= Device::Display::Graphics::Graph->height())           || // Clip bottom
				  ((x + 6 * size - 1) < 0) || // Clip left
				  ((y + 8 * size - 1) < 0))   // Clip top
				return; //ToDo: modify to make buffer
			  if (c < 32) return;
			#ifdef LOAD_GLCD
			//>>>>>>>>>>>>>>>>>>
			#ifdef LOAD_GFXFF
			  if(!gfxFont) { // 'Classic' built-in font
			#endif
			//>>>>>>>>>>>>>>>>>>
			  boolean fillbg = (bg != color);

			  if ((size==1) && fillbg)
			  {
				uint8_t column[6];
				uint8_t mask = 0x1;

				for (int8_t i = 0; i < 5; i++ ) column[i] = pgm_read_byte(font + (c * 5) + i);
				column[5] = 0;

			#if defined (ESP8266) && !defined (ILI9488_DRIVER)
				color = (color >> 8) | (color << 8);
				bg = (bg >> 8) | (bg << 8);

