Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
				for (int8_t j = 0; j < 8; j++) {
				  for (int8_t k = 0; k < 5; k++ ) {
					if (column[k] & mask) {
					  SPI1W0 = color;
					}
					else {
					  SPI1W0 = bg;
					}
					SPI1CMD |= SPIBUSY;
					while(SPI1CMD & SPIBUSY) {}
				  }

				  mask <<= 1;

				  SPI1W0 = bg;
				  SPI1CMD |= SPIBUSY;
				  while(SPI1CMD & SPIBUSY) {}
				}
			#else // for ESP32 or ILI9488
				buf_Bitmap=malloc(40);
				char nul=0, fill=255;

				// load alpha channel for symbol
				for (int8_t j = 0; j < 8; j++) {
				  for (int8_t k = 0; k < 5; k++ ) {
					if (column[k] & mask) {
						memcpy((unsigned char *)buf_Bitmap+5*j+k,&fill,1);
					}else{
						memcpy((unsigned char *)buf_Bitmap+5*j+k,&nul,1);
					}
				  }
				  mask <<= 1;
				  tft_Write_16(bg);
				}

				t_color_r5g6b5 *pix_dst=new (t_color_r5g6b5);
				Device::Display::Graphics::Graph->color_R8G8B8toR5G6B5(pix_dst, (t_color_r8g8b8 *)&color);
				Device::Display::Graphics::Graph->drawImageBufferAlpha(x, y, *pix_dst, (uint8_t*) buf_Bitmap, 5, 8);
				delete(pix_dst);
			#endif

			  }
			  else
			  { // size > 1 or fill with background color

				for (int8_t i = 0; i < 6; i++ ) {
				  uint8_t line;
				  if (i == 5)
					line = 0x0;
				  else
					line = pgm_read_byte(font + (c * 5) + i);

				  if (size == 1) // default size
				  {
					for (int8_t j = 0; j < 8; j++) {
					  if (line & 0x1) drawPixel(x + i, y + j, color);
					  line >>= 1;
					}
				  }
				  else {  // big size
					for (int8_t j = 0; j < 8; j++) {
					  if (line & 0x1) fillRect(x + (i * size), y + (j * size), size, size, color);
					  line >>= 1;
					}
				  }
				}
			  }

			//>>>>>>>>>>>>>>>>>>>>>>>>>>>
			#ifdef LOAD_GFXFF
			  } else { // Custom font
			#endif
			//>>>>>>>>>>>>>>>>>>>>>>>>>>>
			#endif // LOAD_GLCD

			#ifdef LOAD_GFXFF
				// Filter out bad characters not present in font
				if ((c >= pgm_read_word(&gfxFont->first)) && (c <= pgm_read_word(&gfxFont->last )))
				{
//				  spi_begin();          // Sprite class can use this function, avoiding spi_begin()
//				  inTransaction = true; //ToDo: modify to make buffer
			//>>>>>>>>>>>>>>>>>>>>>>>>>>>

				  c -= pgm_read_word(&gfxFont->first);
				  GFXglyph *glyph  = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c]);
				  uint8_t  *bitmap = (uint8_t *)pgm_read_dword(&gfxFont->bitmap);

				  uint32_t bo = pgm_read_word(&glyph->bitmapOffset);
				  uint8_t  w  = pgm_read_byte(&glyph->width),
						   h  = pgm_read_byte(&glyph->height);
						   //xa = pgm_read_byte(&glyph->xAdvance);
				  int8_t   xo = pgm_read_byte(&glyph->xOffset),
						   yo = pgm_read_byte(&glyph->yOffset);
				  uint8_t  xx, yy, bits=0, bit=0;
				  int16_t  xo16 = 0, yo16 = 0;

				  if(size > 1) {
					xo16 = xo;
					yo16 = yo;
				  }

			// Here we have 3 versions of the same function just for evaluation purposes
			// Comment out the next two #defines to revert to the slower Adafruit implementation

			// If FAST_LINE is defined then the free fonts are rendered using horizontal lines
			// this makes rendering fonts 2-5 times faster. Particularly good for large fonts.
			// This is an elegant solution since it still uses generic functions present in the
			// stock library.

			// If FAST_SHIFT is defined then a slightly faster (at least for AVR processors)
			// shifting bit mask is used

			// Free fonts don't look good when the size multiplier is >1 so we could remove
			// code if this is not wanted and speed things up

			#define FAST_HLINE
			#define FAST_SHIFT
			//FIXED_SIZE is an option in User_Setup.h that only works with FAST_LINE enabled

			#ifdef FIXED_SIZE
				  x+=xo; // Save 88 bytes of FLASH
				  y+=yo;
			#endif

			#ifdef FAST_HLINE

			  #ifdef FAST_SHIFT
				  uint16_t hpc = 0; // Horizontal foreground pixel count
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(bit == 0) {
						bits = pgm_read_byte(&bitmap[bo++]);
						bit  = 0x80;
					  }
					  if(bits & bit) hpc++;
					  else {
					   if (hpc) {
			#ifndef FIXED_SIZE
						  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
						  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);//ToDo: modify to make buffer
			#else
						  drawFastHLine(x+xx-hpc, y+yy, hpc, color);
			#endif
						  hpc=0;
						}
					  }
					  bit >>= 1;
					}
				  // Draw pixels for this line as we are about to increment yy
					if (hpc) {
			#ifndef FIXED_SIZE
					  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
					  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);//ToDo: modify to make buffer
			#else
					  drawFastHLine(x+xx-hpc, y+yy, hpc, color);
			#endif
					  hpc=0;
					}
				  }
			  #else
				  uint16_t hpc = 0; // Horizontal foreground pixel count
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(!(bit++ & 7)) {
						bits = pgm_read_byte(&bitmap[bo++]);
					  }
					  if(bits & 0x80) hpc++;
					  else {
						if (hpc) {
						  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
						  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);
						  hpc=0;
						}
					  }
					  bits <<= 1;
					}
					// Draw pixels for this line as we are about to increment yy
					if (hpc) {
					  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
					  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);
					  hpc=0;
					}
				  }
			  #endif

			#else
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(!(bit++ & 7)) {
						bits = pgm_read_byte(&bitmap[bo++]);
					  }
					  if(bits & 0x80) {
						if(size == 1) {
						  drawPixel(x+xo+xx, y+yo+yy, color);
						} else {
						  fillRect(x+(xo16+xx)*size, y+(yo16+yy)*size, size, size, color);
						}
					  }
					  bits <<= 1;
					}
				  }
			#endif
//				  inTransaction = false;
//				  spi_end();//ToDo: modify to make buffer
				}
			#endif


			#ifdef LOAD_GLCD
			  #ifdef LOAD_GFXFF
			  } // End classic vs custom font
			  #endif
			#endif

