Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			}


			/***************************************************************************************
			** Function name:
			** Description:             c_TextBuffer constructor
			***************************************************************************************/

			c_TextBuffer::c_TextBuffer(){
				buffer = new Device::Memory::c_Buffer();
				x=0;
				y=0;
			}

			c_TextBuffer::c_TextBuffer(uint16_t length){
				buffer = new Device::Memory::c_Buffer(1,2,length);
				x=0;
				y=0;
			}
			/***************************************************************************************
			** Function name:
			** Description:             c_TextBuffer destructor
			***************************************************************************************/

			c_TextBuffer::~c_TextBuffer(){
				buffer->remove();
			}

			/***************************************************************************************
			** Function name:
			** Description:
			***************************************************************************************/

			T_DispCoords c_TextBuffer::GetX(){
				return x;
			}

			/***************************************************************************************
			** Function name:
			** Description:
			***************************************************************************************/

			T_DispCoords c_TextBuffer::GetY(){
				return y;
			}

			/***************************************************************************************
			** Function name:
			** Description:
			***************************************************************************************/

			void c_TextBuffer::SetX(T_DispCoords coord){
				x=coord;
			}

			/***************************************************************************************
			** Function name:
			** Description:
			***************************************************************************************/

			void c_TextBuffer::SetY(T_DispCoords coord){
				y=coord;
			}

		}
	}
}


